import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@/shared/ui/accordion"
import Image from "next/image";

export const Faq:React.FC = () => {
    return (
        <>
        <h2 className=" mt-6 bg-white dark:bg-black dark:text-[#fff]  m-auto max-w-[calc(100%-68px)] text-[24px]">Що далі:</h2>
          <Accordion type="single" collapsible className="  border-[#5C5C5C] mt-1 bg-white dark:bg-black dark:text-white px-9  pr-3  max-w-[calc(100%-68px)] ">
                <AccordionItem value="item-11" className="border-b-[#5C5C5C]">
                    <AccordionTrigger className="text-[#c2c2c2] text-[15px]">Ціноутворення та платежі </AccordionTrigger>
                    <AccordionContent className="text-[12px] dark:text-[#c2c2c2] faq-content">
                    <p>Наша система ціноутворення побудована на принципах прозорості та передбачуваності. Основою є фіксований щомісячний платіж, який покриває всі основні витрати, пов&apos;язані з автомобілем, окрім пального. За нашими розрахунками, сукупна вартість користування авто за підпискою за 3 роки лише на 12-14% вища, ніж при прямій купівлі, і ця різниця є вашою платою за повний сервіс та делегування всіх турбот</p>
                    <h3 className="mb-1 text-base font-bold dark:text-white">Що входить у щомісячний платіж:</h3>
                    <ul>
                      <li>Амортизація автомобіля (його природне знецінення).</li>
                      <li>Вартість повного страхування (КАСКО та ОСЦПВ).</li>
                      <li>Витрати на реєстрацію та сплату податків (наприклад, 3-5% до Пенсійного фонду).</li>
                      <li>Вартість регулярного технічного обслуговування, сезонної заміни шин та їх зберігання.</li>
                      <li>Невелика сервісна маржа компанії за організацію всіх процесів.</li>
                    </ul>
                    <h3 className="mb-1 text-base font-bold dark:text-white">Гарантійний депозит:</h3>
                    <p>Для довгострокових тарифів («Підписка» та «Лізинг») передбачено внесення поворотного гарантійного депозиту.</p>
                    <ul>
                      <li><strong>Призначення:</strong> За логікою він схожий на депозит при оренді квартири. Це не аванс на купівлю, а гарантія виконання умов договору, що покриває останні місяці користування.</li>
                      <li><strong>Повернення та перенесення:</strong> Після завершення терміну підписки сума депозиту повністю повертається вам. Якщо ви змінюєте автомобіль в рамках сервісу, депозит у повному обсязі переноситься на новий контракт.</li>
                      <li><strong>Тариф «Оренда»:</strong> Цей тариф не вимагає депозиту, замість нього є разова комісія, що робить старт користування максимально доступним</li>
                    </ul>
                    <h3 className="mb-1 text-base font-bold dark:text-white">Способи оплати:</h3>
                    <p>Ми приймаємо безготівкові перекази, оплату карткою, а також платежі у криптовалюті. Весь процес проходить без фінансового моніторингу з боку банків, що забезпечує вашу конфіденційність.</p>
                    </AccordionContent>
                </AccordionItem>
                <AccordionItem value="item-12" className="border-b-[#5C5C5C]">
                    <AccordionTrigger className="text-[#c2c2c2] text-[15px]">Оформлення, видача авто </AccordionTrigger>
                    <AccordionContent className="text-[12px] dark:text-[#c2c2c2] faq-content">
                     <p>Ми повністю переосмислили процес отримання автомобіля, звівши його до кількох простих та швидких кроків, що в середньому займають</p>
                     <p><span>29 хвилин</span> від фінального підтвердження.</p>
                    <h3 className="mb-1 text-base font-bold dark:text-white">Процес оформлення:</h3>
                    <ol>
                      <li>Заявка та консультація: Ви залишаєте заявку на сайті, і наш менеджер допомагає обрати оптимальну модель та тариф під ваші задачі.</li>
                      <li>Розширений тест-драйв: Ми організовуємо для вас індивідуальний тест-драйв тривалістю до 2 годин, щоб ви могли відчути автомобіль у реальних умовах — у міському трафіку, на трасі, вдень та ввечері.</li>
                      <li>Перевірка документів: Ми не вимагаємо довідок про доходи. Для оформлення потрібен лише паспорт, ІПН та водійське посвідчення. Наша перевірка базується на репутаційних критеріях, зокрема аналізі профілів у соцмережах, та особистому спілкуванні.</li>
                      <li>Видача авто: Після підписання договору ви отримуєте автомобіль. Процес видачі може відбуватися в нашому хабі або ми можемо доставити авто за зручною для вас адресою. Автомобіль передається вам бездоганно підготовленим: із повним баком пального, захисною бронеплівкою, тонуванням та повним комплектом необхідних аксесуарів (аптечка, вогнегасник, компресор, парасолька, дорожня подушка та навіть комплімент від компанії).</li>
                    </ol>
                    </AccordionContent>
                </AccordionItem>
                <AccordionItem value="item-13" className="border-b-[#5C5C5C]">
                    <AccordionTrigger className="text-[#c2c2c2] text-[15px]">Страхування, захист авто </AccordionTrigger>
                    <AccordionContent className="text-[12px] dark:text-[#c2c2c2] faq-content">
                     <p>Ваш спокій та безпека є нашим пріоритетом. Тому кожен автомобіль Drivovo має максимальний рівень страхового захисту, вартість якого вже включена у ваш щомісячний платіж.</p>
                    <h3 className="mb-1 text-base font-bold dark:text-white">Що входить у пакет страхування:</h3>
                    <ul>
                      <li>Повне КАСКО: Покриває будь-які пошкодження вашого автомобіля, включаючи викрадення. Зазвичай поліс має нульову франшизу. Винятками є лише пошкодження гуми/дисків або випадки, що сталися через грубе порушення умов договору (наприклад, керування у стані сп&apos;яніння).</li>
                      <li>ОСЦПВ (автоцивілка): Обов&apos;язкове страхування, що покриває відповідальність перед третіми особами у випадку ДТП з вашої вини.</li>
                      <li>Зелена карта: Для поїздок за кордон ми надаємо відповідний страховий поліс.</li>
                    </ul>
                    <h3 className="mb-1 text-base font-bold dark:text-white">Як це працює:</h3>
                    <p>У разі настання страхового випадку (ДТП, пошкодження авто на парковці тощо) ваш єдиний обов&apos;язок — повідомити про це вашого персонального менеджера Drivovo через чат підтримки. Ми повністю беремо на себе комунікацію зі страховою компанією, виклик поліції (за потреби) та організацію всіх подальших дій. Вам не доведеться вести переговори, заповнювати документи чи контролювати процес ремонту.</p>
                    </AccordionContent>
                </AccordionItem>
                <AccordionItem value="item-15" className="border-b-[#5C5C5C]">
                    <AccordionTrigger className="text-[#c2c2c2] text-[15px]">ТО, ДТП, підмінне авто </AccordionTrigger>
                    <AccordionContent className="text-[12px] dark:text-[#c2c2c2] faq-content">
                     <p>Ми розглядаємо автомобіль як систему, яка має працювати бездоганно та не створювати вам турбот. Тому ми повністю забираємо на себе управління всіма сервісними та кризовими ситуаціями.</p>
                    <h3 className="mb-1 text-base font-bold dark:text-white">Технічне обслуговування (ТО):</h3>
                    <ul>
                      <li>Вам не потрібно пам&apos;ятати про терміни ТО. Наша система моніторить пробіг, і ми заздалегідь зв&apos;яжемося з вами, щоб узгодити зручний час для планового обслуговування.</li>
                      <li>Ми обслуговуємо авто лише на офіційних або сертифікованих партнерських СТО, гарантуючи якість робіт. Усі витрати на ТО вже включені у ваш тариф (з розрахунку пробігу до 36 000 км на рік).</li>
                    </ul>
                    <h3 className="mb-1 text-base font-bold dark:text-white">Дії у випадку ДТП:</h3>
                    <ul>
                      <li>Зв&apos;яжіться з нашою цілодобовою лінією підтримки. Наш фахівець надасть чіткі інструкції та візьме подальшу комунікацію на себе.</li>
                      <li>Поки ваш автомобіль перебуває на ремонті, ми надамо вам підмінний, щоб ви не втрачали мобільності та не змінювали свої плани. Це ключова перевага, оскільки в класичній оренді підмінне авто у випадку ДТП зазвичай не надається.</li>
                    </ul>
                    <p>Поломка або несправність:</p>
                    <p>У малоймовірному випадку технічної несправності (оскільки всі авто нові та на гарантії), ми так само беремо на себе спілкування з офіційними дилерами та організацію гарантійного ремонту.</p>
                    </AccordionContent>
                </AccordionItem>
                <AccordionItem value="item-35" className="border-b-[#5C5C5C]">
                    <AccordionTrigger className="text-[#c2c2c2] text-[15px]">Викуп авто, переоформлення </AccordionTrigger>
                    <AccordionContent className="text-[12px] dark:text-[#c2c2c2] faq-content">
                     <p>Ми розробили нашу систему так, щоб на кожному етапі ви мали максимальну свободу вибору. Можливість викупу автомобіля — це логічне завершення цього принципу. Якщо за час підписки автомобіль став для вас по-справжньому своїм, ви можете легко перевести його у свою власність. Це ваше право, а не зобов&apos;язання.</p>
                     <h3 className="mb-1 text-base font-bold dark:text-white">Умови викупу:</h3>
                    
                    <ul>
                      <li><span>Доступність опції:</span> Можливість викупу передбачена для довгострокових тарифів — <span>«Підписка (сабскрайб клаб)»</span> та <span>«Лізинг (старт лізинг)»</span>. Зазвичай, ця опція стає доступною після 36 місяців користування автомобілем1. Тариф «Оренда (флекс)» не передбачає викупу, оскільки орієнтований на короткострокові гнучкі потреби.</li>
                      <li><span>Прозора та зафіксована ціна:</span> Вартість викупу — це <span>залишкова вартість</span> автомобіля, яка чітко прораховується та фіксується у вашому договорі з першого дня. Це усуває будь-яку невизначеність чи необхідність торгів у майбутньому. Ви точно знаєте, скільки коштуватиме ваш автомобіль через 3 роки.</li>
                      <li><span>Зарахування депозиту:</span> Ваш гарантійний депозит, внесений на початку підписки, може бути використаний для оплати частини залишкової вартості, що робить фінальний платіж ще меншим.</li>
                    </ul>
                    <h3 className="mb-1 text-base font-bold dark:text-white">Процес переоформлення:</h3>
                    <p>Ми залишаємося вірними нашій філософії та беремо на себе всю бюрократичну частину процесу.</p>
                    <ol>
                      <li>Ваше рішення: Ви повідомляєте вашого персонального менеджера про намір викупити автомобіль.</li>
                      <li>Підготовка документів: Ми готуємо договір купівлі-продажу та всі необхідні документи для перереєстрації автомобіля на ваше ім&apos;я.</li>
                      <li>Фіналізація угоди: Ви підписуєте договір та сплачуєте залишкову вартість.</li>
                      <li>Перереєстрація: Наші фахівці супроводжують процес переоформлення в сервісному центрі, мінімізуючи вашу участь та заощаджуючи ваш час.</li>
                    </ol>
                    <p>Таким чином, процес переходу автомобіля у вашу власність є таким самим простим та прозорим, як і весь сервіс Drivovo</p>
                    </AccordionContent>
                </AccordionItem>
            </Accordion>
               <Image 
                              src="/assets/images/img_287.jpg" 
                              alt='drivovo' 
                              width={1440}
                              height={820}
                              className="w-full h-auto mt-6 "
                          />
        </>
    )

}
