

export default async function TypePage() {

  return (
      <section className="max-w-[1200px] w-full mx-auto my-10 text-[10px] px-4">
        <h1 className="text-[32px] mb-6 pl-4">Політика конфіденційності</h1>
   
          <h2 className="text-xl my-4">1. Загальні положення</h2>

          <p className="font-bold mt-3 mb-1">I. Ця Політика конфіденційності визначає правила обробки, зберігання та захисту персональних даних користувачів сайту drivovo.com. Документ розроблено відповідно до Регламенту (ЄС) 2016/679 (RODO/GDPR) та національних законодавчих вимог. Нашою метою є забезпечення повної прозорості та захисту прав користувачів.</p>

          <p className="font-bold mt-3 mb-1">II. Адміністратор даних</p>
          <div>
            Адміністратор даних: <br />
          DRIVOVOPL Спілка з обмеженою відповідальністю <br />
          Адреса: вул. Plac Konesera 2, 03-736 Варшава, Польща <br />
          KRS: 0001066169 <br />
          NIP: 1133113608 <br />

          <p className="font-bold mt-3 mb-1">III. Цілі та підстави обробки даних</p>
          <p className="pl-3">• Надання послуг:</p>
          <p>Забезпечення можливості реєстрації, оформлення замовлень та обслуговування клієнтів.</p>
          <p>Підстава: виконання договору або здійснення дій за запитом користувача.</p>
          <p className="pl-3">• Аналіз та оптимізація сайту:</p>
          <p>Збір та аналіз даних про відвідуваність сайту з метою покращення його функціональності.</p>
          <p>Підстава: законний інтерес адміністратора.</p>
          <p className="pl-3">• Маркетинг та просування:</p>
          <p>Надання інформації про новинки, акції та продукти – виключно після надання згоди користувача.</p>
          <p>Підстава: згода користувача.</p>
          <p>Приклад: Дані можуть використовуватись для сегментації користувачів та персоналізації пропозицій, що дозволяє краще адаптувати контент під потреби аудиторії.</p>
          <p className="font-bold mt-3 mb-1">IV. Безпека та терміни зберігання даних</p>
          <p className="pl-3">• Безпека: Ми застосовуємо відповідні технічні та організаційні заходи для захисту даних від несанкціонованого доступу, модифікації або знищення.</p>
          <p className="pl-3">• Терміни зберігання:</p>
          <p className="pl-3">• Дані зберігаються протягом періоду, необхідного для досягнення цілей, для яких вони були зібрані, після чого видаляються або анонімізуються.</p>
          <p className="pl-3">• У разі обробки даних на підставі згоди – до моменту відкликання цієї згоди.</p>
          <p className="font-bold mt-3 mb-1">V. Одержувачі даних</p>
          <p>Персональні дані можуть бути передані наступним суб’єктам:</p>
          <p className="pl-3">• Постачальникам хостинг-послуг – для забезпечення стабільної та безпечної роботи сайту.
</p>
          <p className="pl-3">• Аналітичним службам (наприклад, Google Analytics) – для збору статистики та оптимізації роботи сайту.</p>
          <p className="pl-3">• Партнерам по бізнесу – виключно у випадках, коли це необхідно для виконання договору або за додатковою згодою користувача.</p>
          <p className="font-bold mt-3 mb-1">VI. Права користувачів</p>
          <p>Кожен користувач має право на:</p>
          <p className="pl-3">• Доступ до даних: отримання інформації про обробку своїх персональних даних.</p>
          <p className="pl-3">• Виправлення даних: вимагання коригування некоректної або неповної інформації.</p>
          <p className="pl-3">• Видалення даних: «право бути забутим».</p>
          <p className="pl-3">• Обмеження обробки: тимчасове обмеження використання даних.</p>
          <p className="pl-3">• Перенесення даних: отримання копії даних у структурованому форматі для можливості передачі іншому адміністратору.</p>
          <p className="pl-3">• Висловлення заперечення: проти обробки даних, особливо в маркетингових цілях.</p>
          <p className="pl-3">• Подання скарги: до органу нагляду – до Уряду з захисту даних особистості (UODO).</p>
          <p className="font-bold mt-3 mb-1">VII. Передача даних за межі ЄЕЗ</p>
          <p>У разі передачі персональних даних за межі Європейського економічного простору (ЄЕЗ) ми забезпечуємо застосування відповідних заходів захисту відповідно до вимог RODO.</p>
          <p className="font-bold mt-3 mb-1">VIII. Зміни в Політиці конфіденційності</p>
          <p>Адміністратор залишає за собою право вносити зміни до цієї політики. Про суттєві зміни користувачі будуть повідомлені через публікацію оновленої версії на сайті.</p>
          <p className="font-bold mt-3 mb-1">IX. Контакти та додаткова інформація</p>
          <p>Всі питання щодо обробки персональних даних просимо надсилати на контактну адресу, вказану на сайті. У разі порушення прав користувач може подати скаргу до:</p>
          <p>Уряду з захисту даних особистості (UODO),</p>
          <p>вул. Stawki 2, 00-193 Варшава, Польща</p>
          <p>Сайт UODO</p>
        </div>
    
    <div>
      <h2 className="text-xl my-4">2. Політика щодо кукі</h2>

      <p className="font-bold mt-3 mb-1">I. Загальні положення</p>
      <p>Ця Політика щодо кукі пояснює, які файли cookies використовуються на сайті drivovo.com, з якою метою та яким чином користувач може керувати своїми налаштуваннями. Документ розроблено згідно з вимогами Закону про надання послуг електронного зв’язку (ст. 173, 174) та RODO/GDPR.</p>
      <p className="font-bold mt-3 mb-1">II. Що таке кукі?</p>
      <p>Кукі – це невеликі текстові файли, що зберігаються на пристрої користувача, які дозволяють:</p>
      <p className="pl-3">• Забезпечувати належне функціонування сайту,</p>
      <p className="pl-3">• Запам’ятовувати налаштування користувача (наприклад, мову, уподобання),</p>
      <p className="pl-3">• Збирати анонімні статистичні дані про відвідуваність сайту.</p>
      <p className="font-bold mt-3 mb-1">III. Види кукі, що використовуються на сайті</p>
      <p>1. Необхідні кукі:</p>
      <p className="pl-3">• Забезпечують базові функції сайту (наприклад, вхід в систему, роботу кошика).</p>
      <p className="pl-3">• Встановлюються автоматично без потреби отримання згоди.</p>
      <p>2. Функціональні кукі:</p>
      <p className="pl-3">• Дозволяють персоналізувати налаштування, такі як вибір мови або регіону.</p>
      <p className="pl-3">• Можуть встановлюватися після отримання згоди користувача, якщо не є критичними для роботи сайту.</p>
      <p>3. Аналітичні кукі:</p>
      <p className="pl-3">• Використовуються для збору даних про поведінку користувачів (наприклад, за допомогою Google Analytics).</p>
      <p className="pl-3">• Термін зберігання може становити до 2 років.</p>
      <p className="pl-3">• Вимагають згоди користувача.</p>
      <p>4. Маркетингові кукі:</p>
      <p className="pl-3">• Використовуються для персоналізації реклами та відстеження ефективності маркетингових кампаній.</p>
      <p className="pl-3">• Встановлюються сторонніми суб’єктами (наприклад, Google Ads).</p>
      <p className="pl-3">• Вимагають явної згоди.</p>
      <p className="font-bold mt-3 mb-1">IV. Механізм отримання згоди</p>
      <p>При першому відвідуванні сайту користувач бачить чіткий банер, який пропонує наступні опції:</p>
      <p className="pl-3">• “Прийняти” – згода на встановлення всіх видів кукі.</p>
      <p className="pl-3">• “Налаштувати” – можливість обрати, які саме кукі користувач хоче прийняти.</p>
      <p className="pl-3">•“Відхилити” – відмова від встановлення аналітичних та маркетингових кукі (необхідні кукі завжди активні).</p>
      <p>Приклад тексту банера:</p>
      <p>“Наш сайт використовує кукі, щоб забезпечити вам найкращий досвід, аналізувати трафік та персоналізувати контент. Натисніть ‘Прийняти’, щоб надати згоду, або ‘Налаштувати’, щоб керувати налаштуваннями.”</p>
      <p className="font-bold mt-3 mb-1">V. Інструкції щодо керування кукі</p>
      <p>Користувач може у будь-який момент змінити налаштування щодо кукі у своєму браузері:</p>
      <p className="pl-3">• Google Chrome:</p>
      <p>Налаштування → Конфіденційність і безпека → Налаштування сайтів → Кукі та дані сайтів.</p>
      <p className="pl-3">• Mozilla Firefox:</p>
      <p>Параметри → Приватність та безпека → Кукі та дані сайтів.</p>
      <p>Для інших браузерів рекомендується скористатись відповідними інструкціями або довідкою онлайн.</p>
      <p className="font-bold mt-3 mb-1">VI. Кукі від сторонніх суб’єктів</p>
      <p>На сайті можуть використовуватись кукі, що надаються зовнішніми партнерами (наприклад, Google Analytics, Google Ads). Ми не контролюємо політику конфіденційності цих суб’єктів – радимо ознайомитись із їхніми регламентами.</p>
      <p className="font-bold mt-3 mb-1">VII. Відповідальність та зміни в політиці</p>
      <p className="pl-3">• Відповідальність: Сайт drivovo.com не несе відповідальності за кукі, розміщені на сторонніх ресурсах або встановлені третіми сторонами.</p>
      <p className="pl-3">• Зміни в політиці: Адміністратор залишає за собою право вносити зміни до цієї політики. Користувачі будуть повідомлені про суттєві зміни через публікацію оновленої версії на сайті.</p>
     
    </div>


    </section> 
  )
}
