export const reviewsArr = [
  {
  height: '130px',
  name: 'Іванова Марія',
  status: 'Head of Estore у Samsung',
  avatar: '/assets/images/av1.jpg',
  text: ' "Зосередься на тому, що для тебе важливо і насолоджуйся життям"- дуже вражаючий підхід і філософіяНайцікавіші поєднання, гнучкість умов, не просто клієнтоорієнтованість, а розвиток відносин, формат клубу інтересів - мрія водія)'
  },
  {
  height: '170px',
  name: 'Криворучко Юрій',
  status: 'Працює в Dyvotech',
  avatar: '/assets/images/av2.jpg',
  text: 'Чудовий сервіс. Наскільки мені відомо, перший в Україні.Виграв сертифікат про поїздку на авто на вихідних. Автомобіль доставили до будинку через день після запиту.Однозначно рекомендую!'
  },
  {
  height: '170px',
  name: 'Бирчанко Кирило',
  status: 'Software engineer у PandaDoc',
  avatar: '/assets/images/av3.jpg',
  text: 'У Drivovo головним пріоритетом є не автомобілі, а клієнти та ставлення до них. Drivovo робить все необхідне для того, щоб користувачі були щасливими, а мені подобається працювати з їх командою як клієнт. Дуже радий, що познайомився з компанією і скористався їх підпискою.'
  },
  {
  height: '170px',
  name: 'Анна Тартасюк',
  status: 'Business Intern у Goole',
  avatar: '/assets/images/av4.jpg',
  text: 'Сервіс, який унікальний своєю ідеєю з крутим персоналізованим підходом🚀Широкий вибір авто в крутих зборках, чудова комунікація, дуже рекомендую!'
  },

]